leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <esp_check.h>
#include <esp_event.h>
#include <esp_http_server.h>
#include <esp_log.h>
#include <esp_netif.h>
#include <esp_system.h>
#include <esp_wifi.h>
#include <esp_wifi_ap_get_sta_list.h>
#include <esp_wifi_default.h>
#include <freertos/FreeRTOS.h>
#include <freertos/event_groups.h>
#include <freertos/task.h>
#include <mdns.h>
#include <nvs.h>
#include <nvs_flash.h>
#include <lwip/sockets.h>

#include "esp32-wifi-drone-remote.h"

static const char *TAG = "wifi-drone-remote";
static const EventBits_t WIFI_CONNECTED_BIT = BIT0;
static const EventBits_t WIFI_FAILED_BIT = BIT1;
static const char *NETWORK_HOSTNAME = "esp32drone";
static const char *WIFI_CREDENTIALS_PARTITION = "wifi_creds";
static const char *WIFI_NVS_NAMESPACE = "drone_remote";

static EventGroupHandle_t s_wifi_events;
static esp_event_handler_instance_t s_wifi_handler;
static esp_event_handler_instance_t s_ip_handler;
static esp_netif_t *s_netif;
static httpd_handle_t s_server;
static bool s_started;
static bool s_mdns_started;
static bool s_wifi_scan_in_progress;
static wifi_mode_t s_wifi_mode = WIFI_MODE_NULL;
static esp32_wifi_drone_remote_api_handler_t s_api_handler;
static void *s_api_context;
static esp32_wifi_drone_remote_latency_handler_t s_latency_handler;
static void *s_latency_context;
static uint32_t s_latency_timeout_ms = 150U;
static esp32_wifi_drone_remote_telemetry_handler_t s_telemetry_handler;
static void *s_telemetry_context;
static esp32_wifi_drone_remote_imu_get_handler_t s_imu_get_handler;
static esp32_wifi_drone_remote_imu_set_handler_t s_imu_set_handler;
static void *s_imu_context;
static esp32_wifi_drone_remote_esc_get_handler_t s_esc_get_handler;
static esp32_wifi_drone_remote_esc_set_handler_t s_esc_set_handler;
static esp32_wifi_drone_remote_esc_throttle_handler_t s_esc_throttle_handler;
static void *s_esc_context;
static char s_saved_station_ssid[33];
static char s_saved_station_password[65];
static char s_saved_ap_ssid[33];
static char s_saved_ap_password[65];
static esp32_wifi_drone_remote_config_t s_effective_config;

extern const uint8_t controller_html_start[]
    asm("_binary_controller_html_start");
extern const uint8_t wifi_setup_html_start[]
    asm("_binary_wifi_setup_html_start");
extern const uint8_t settings_html_start[]
    asm("_binary_settings_html_start");
extern const uint8_t wifi_ap_settings_html_start[]
    asm("_binary_wifi_ap_settings_html_start");
extern const uint8_t imu_settings_html_start[]
    asm("_binary_imu_settings_html_start");
extern const uint8_t esc_settings_html_start[]
    asm("_binary_esc_settings_html_start");
extern const uint8_t esc_pwm_channel_settings_html_start[]
    asm("_binary_esc_pwm_channel_settings_html_start");
extern const uint8_t esc_manual_html_start[]
    asm("_binary_esc_manual_html_start");

/**
 * @brief Advertise the controller through multicast DNS.
 *
 * @return ESP_OK on success, otherwise an mDNS initialization error.
 */
static esp_err_t start_mdns(void)
{
    ESP_RETURN_ON_ERROR(mdns_init(), TAG, "Could not initialize mDNS");
    s_mdns_started = true;
    ESP_RETURN_ON_ERROR(mdns_hostname_set(NETWORK_HOSTNAME), TAG,
                        "Could not set mDNS hostname");
    ESP_RETURN_ON_ERROR(
        mdns_instance_name_set("ESP32 Drone Remote"), TAG,
        "Could not set mDNS instance name");
    ESP_RETURN_ON_ERROR(
        mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0), TAG,
        "Could not advertise HTTP service");
    ESP_LOGI(TAG, "Controller available at http://%s.local",
             NETWORK_HOSTNAME);
    return ESP_OK;
}

/**
 * @brief Process Wi-Fi station lifecycle events.
 *
 * Starts the station connection after Wi-Fi initialization and signals the
 * waiting startup task when the station either receives an IP address or is
 * disconnected.
 *
 * @param arg Unused event-handler context.
 * @param event_base Event source (`WIFI_EVENT` or `IP_EVENT`).
 * @param event_id Event identifier within the source.
 * @param event_data Unused event-specific data.
 */
static void wifi_event_handler(void *arg, esp_event_base_t event_base,
                               int32_t event_id, void *event_data)
{
    (void)arg;
    (void)event_data;

    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START &&
        !s_wifi_scan_in_progress) {
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT &&
               event_id == WIFI_EVENT_STA_DISCONNECTED) {
        xEventGroupSetBits(s_wifi_events, WIFI_FAILED_BIT);
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        xEventGroupSetBits(s_wifi_events, WIFI_CONNECTED_BIT);
    }
}

/**
 * @brief Serve the embedded controller page.
 *
 * @param request HTTP GET request for the root URI.
 * @return ESP_OK when the response is sent, otherwise an HTTP-server error.
 */
static esp_err_t page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)controller_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

/**
 * @brief Serve the embedded station configuration page.
 *
 * @param request HTTP GET request for `/wifi`.
 * @return ESP_OK when the response is sent, otherwise an HTTP-server error.
 */
static esp_err_t wifi_setup_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)wifi_setup_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

/** @brief Serve the embedded settings menu. */
static esp_err_t settings_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)settings_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

