leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
/** @brief Serve the embedded Wi-Fi access-point settings page. */
static esp_err_t ap_settings_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)wifi_ap_settings_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

/** @brief Serve the embedded ISM330DLC settings page. */
static esp_err_t imu_settings_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)imu_settings_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

/** @brief Serve the XW30A settings menu. */
static esp_err_t esc_settings_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)esc_settings_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

/** @brief Serve the XW30A PWM-channel settings page. */
static esp_err_t esc_pwm_channel_settings_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(
        request, (const char *)esc_pwm_channel_settings_html_start,
        HTTPD_RESP_USE_STRLEN);
}

/** @brief Serve the manual XW30A throttle-control page. */
static esp_err_t esc_manual_page_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html");
    httpd_resp_set_hdr(request, "Cache-Control",
                       "no-store, no-cache, must-revalidate");
    return httpd_resp_send(request, (const char *)esc_manual_html_start,
                           HTTPD_RESP_USE_STRLEN);
}

/**
 * @brief Return the Wi-Fi mode and RSSI visible to the requesting browser.
 *
 * In station mode the RSSI belongs to the upstream access point. In
 * access-point mode it belongs to the station making this HTTP request.
 *
 * @param request HTTP GET request for `/api/status`.
 * @return ESP_OK after responding, otherwise an HTTP-server error.
 */
static esp_err_t status_handler(httpd_req_t *request)
{
    int rssi = -127;
    const char *mode = "unknown";

    if (s_wifi_mode == WIFI_MODE_STA) {
        wifi_ap_record_t access_point;
        mode = "sta";
        if (esp_wifi_sta_get_ap_info(&access_point) == ESP_OK) {
            rssi = access_point.rssi;
        }
    } else if (s_wifi_mode == WIFI_MODE_AP) {
        wifi_sta_list_t stations;
        mode = "ap";
        if (esp_wifi_ap_get_sta_list(&stations) == ESP_OK &&
            stations.num > 0) {
            int selected = 0;
            struct sockaddr_in peer;
            socklen_t peer_length = sizeof(peer);
            int socket = httpd_req_to_sockfd(request);
            wifi_sta_mac_ip_list_t station_ips;

            if (getpeername(socket, (struct sockaddr *)&peer,
                            &peer_length) == 0 &&
                esp_wifi_ap_get_sta_list_with_ip(&stations, &station_ips) ==
                    ESP_OK) {
                for (int i = 0; i < stations.num; ++i) {
                    if (station_ips.sta[i].ip.addr ==
                        peer.sin_addr.s_addr) {
                        selected = i;
                        break;
                    }
                }
            }
            rssi = stations.sta[selected].rssi;
        }
    }

    char response[80];
    int length = snprintf(response, sizeof(response),
                          "{\"mode\":\"%s\",\"rssi\":%d,\"timeout_ms\":%lu}",
                          mode, rssi,
                          (unsigned long)s_latency_timeout_ms);
    httpd_resp_set_type(request, "application/json");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_send(request, response, length);
}

/**
 * @brief Receive a browser latency sample and notify the application.
 */
static esp_err_t latency_handler(httpd_req_t *request)
{
    char body[48];
    if (request->content_len == 0U ||
        request->content_len >= sizeof(body)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid latency sample");
    }
    int received = httpd_req_recv(request, body, request->content_len);
    if (received != (int)request->content_len) {
        return ESP_FAIL;
    }
    body[received] = '\0';

    unsigned long latency_ms;
    if (sscanf(body, "{\"latency_ms\":%lu}", &latency_ms) != 1 ||
        latency_ms > UINT32_MAX) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid latency sample");
    }
    if (s_latency_handler != NULL) {
        s_latency_handler((uint32_t)latency_ms,
                          latency_ms > s_latency_timeout_ms,
                          s_latency_context);
    }
    httpd_resp_set_status(request, "204 No Content");
    return httpd_resp_send(request, NULL, 0);
}

/**
 * @brief Return application-provided IMU vectors as JSON.
 */
static esp_err_t telemetry_handler(httpd_req_t *request)
{
    if (s_telemetry_handler == NULL) {
        httpd_resp_set_status(request, "503 Service Unavailable");
        return httpd_resp_sendstr(request,
                                  "Telemetry provider is not configured");
    }

    esp32_wifi_drone_remote_telemetry_t telemetry = { 0 };
    esp_err_t err = s_telemetry_handler(&telemetry, s_telemetry_context);
    if (err != ESP_OK) {
        httpd_resp_set_status(request, "503 Service Unavailable");
        return httpd_resp_sendstr(request, esp_err_to_name(err));
    }

    char response[224];
    int length = snprintf(
        response, sizeof(response),
        "{\"accelerometer\":{\"x\":%.5f,\"y\":%.5f,\"z\":%.5f},"
        "\"gyroscope\":{\"x\":%.5f,\"y\":%.5f,\"z\":%.5f}}",
        telemetry.acceleration_x, telemetry.acceleration_y,
        telemetry.acceleration_z, telemetry.gyroscope_x,
        telemetry.gyroscope_y, telemetry.gyroscope_z);
    httpd_resp_set_type(request, "application/json");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_send(request, response, length);
}

