leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
/** @brief Return current application-provided IMU acquisition settings. */
static esp_err_t imu_config_get_handler(httpd_req_t *request)
{
    if (s_imu_get_handler == NULL) {
        httpd_resp_set_status(request, "503 Service Unavailable");
        return httpd_resp_sendstr(request, "IMU settings API is not configured");
    }
    esp32_wifi_drone_remote_imu_config_t config;
    esp_err_t err = s_imu_get_handler(&config, s_imu_context);
    if (err != ESP_OK) {
        httpd_resp_set_status(request, "503 Service Unavailable");
        return httpd_resp_sendstr(request, esp_err_to_name(err));
    }
    char response[128];
    int length = snprintf(
        response, sizeof(response),
        "{\"accel_odr\":%u,\"gyro_odr\":%u,"
        "\"accel_scale\":%u,\"gyro_scale\":%u}",
        config.accelerometer_odr, config.gyroscope_odr,
        config.accelerometer_full_scale, config.gyroscope_full_scale);
    httpd_resp_set_type(request, "application/json");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_send(request, response, length);
}

/** @brief Validate and dispatch submitted IMU acquisition settings. */
static esp_err_t imu_config_post_handler(httpd_req_t *request)
{
    char body[128];
    char accel_odr[4], gyro_odr[4], accel_scale[3], gyro_scale[3];
    if (request->content_len == 0U ||
        request->content_len >= sizeof(body)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid IMU settings");
    }
    int received = httpd_req_recv(request, body, request->content_len);
    if (received != (int)request->content_len) {
        return ESP_FAIL;
    }
    body[received] = '\0';
    if (httpd_query_key_value(body, "accel_odr", accel_odr,
                              sizeof(accel_odr)) != ESP_OK ||
        httpd_query_key_value(body, "gyro_odr", gyro_odr,
                              sizeof(gyro_odr)) != ESP_OK ||
        httpd_query_key_value(body, "accel_scale", accel_scale,
                              sizeof(accel_scale)) != ESP_OK ||
        httpd_query_key_value(body, "gyro_scale", gyro_scale,
                              sizeof(gyro_scale)) != ESP_OK) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid IMU settings");
    }
    esp32_wifi_drone_remote_imu_config_t config = {
        .accelerometer_odr = (uint8_t)atoi(accel_odr),
        .gyroscope_odr = (uint8_t)atoi(gyro_odr),
        .accelerometer_full_scale = (uint8_t)atoi(accel_scale),
        .gyroscope_full_scale = (uint8_t)atoi(gyro_scale),
    };
    if (config.accelerometer_odr > 10U || config.gyroscope_odr > 10U ||
        config.accelerometer_full_scale > 3U ||
        config.gyroscope_full_scale > 3U ||
        s_imu_set_handler == NULL) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Unsupported IMU settings");
    }
    esp_err_t err = s_imu_set_handler(&config, s_imu_context);
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   esp_err_to_name(err));
    }
    httpd_resp_set_status(request, "204 No Content");
    return httpd_resp_send(request, NULL, 0);
}

/** @brief Return the active configuration for a selected ESC channel. */
static esp_err_t esc_config_get_handler(httpd_req_t *request)
{
    char query[32];
    char index_text[4];
    if (s_esc_get_handler == NULL ||
        httpd_req_get_url_query_str(request, query, sizeof(query)) != ESP_OK ||
        httpd_query_key_value(query, "index", index_text,
                              sizeof(index_text)) != ESP_OK) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "ESC index is required");
    }
    unsigned long index = strtoul(index_text, NULL, 10);
    if (index >= ESP32_WIFI_DRONE_REMOTE_ESC_COUNT) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid ESC index");
    }

    esp32_wifi_drone_remote_esc_config_t config = {
        .index = (uint8_t)index,
    };
    esp_err_t err = s_esc_get_handler(&config, s_esc_context);
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   esp_err_to_name(err));
    }
    char response[192];
    int length = snprintf(
        response, sizeof(response),
        "{\"index\":%u,\"gpio\":%u,\"frequency\":%u,"
        "\"min_pulse\":%u,\"max_pulse\":%u,\"calibration_ms\":%u}",
        config.index, config.signal_gpio, config.pwm_frequency_hz,
        config.min_pulse_us, config.max_pulse_us,
        config.calibration_high_time_ms);
    httpd_resp_set_type(request, "application/json");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_send(request, response, length);
}

/** @brief Validate and dispatch a selected ESC channel's configuration. */
static esp_err_t esc_config_post_handler(httpd_req_t *request)
{
    char body[192];
    char index[4], gpio[4], frequency[8], min_pulse[8], max_pulse[8];
    char calibration_ms[8];
    if (request->content_len == 0U ||
        request->content_len >= sizeof(body)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid ESC settings");
    }
    int received = httpd_req_recv(request, body, request->content_len);
    if (received != (int)request->content_len) {
        return ESP_FAIL;
    }
    body[received] = '\0';
    if (httpd_query_key_value(body, "index", index, sizeof(index)) != ESP_OK ||
        httpd_query_key_value(body, "gpio", gpio, sizeof(gpio)) != ESP_OK ||
        httpd_query_key_value(body, "frequency", frequency,
                              sizeof(frequency)) != ESP_OK ||
        httpd_query_key_value(body, "min_pulse", min_pulse,
                              sizeof(min_pulse)) != ESP_OK ||
        httpd_query_key_value(body, "max_pulse", max_pulse,
                              sizeof(max_pulse)) != ESP_OK ||
        httpd_query_key_value(body, "calibration_ms", calibration_ms,
                              sizeof(calibration_ms)) != ESP_OK ||
        s_esc_set_handler == NULL) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid ESC settings");
    }
    unsigned long values[] = {
        strtoul(index, NULL, 10), strtoul(gpio, NULL, 10),
        strtoul(frequency, NULL, 10), strtoul(min_pulse, NULL, 10),
        strtoul(max_pulse, NULL, 10), strtoul(calibration_ms, NULL, 10),
    };
    if (values[0] >= ESP32_WIFI_DRONE_REMOTE_ESC_COUNT ||
        values[1] > UINT8_MAX || values[2] == 0U || values[2] > UINT16_MAX ||
        values[3] == 0U || values[3] > UINT16_MAX ||
        values[4] <= values[3] || values[4] > UINT16_MAX ||
        values[5] == 0U || values[5] > UINT16_MAX ||
        (1000000UL / values[2]) <= values[4]) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Unsupported ESC settings");
    }
    const esp32_wifi_drone_remote_esc_config_t config = {
        .index = values[0],
        .signal_gpio = values[1],
        .pwm_frequency_hz = values[2],
        .min_pulse_us = values[3],
        .max_pulse_us = values[4],
        .calibration_high_time_ms = values[5],
    };
    esp_err_t err = s_esc_set_handler(&config, s_esc_context);
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   esp_err_to_name(err));
    }
    httpd_resp_set_status(request, "204 No Content");
    return httpd_resp_send(request, NULL, 0);
}

/** @brief Apply a manual normalized throttle value to one ESC channel. */
static esp_err_t esc_throttle_post_handler(httpd_req_t *request)
{
    char body[64];
    char index_text[4], throttle_text[8];
    if (request->content_len == 0U ||
        request->content_len >= sizeof(body)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid ESC throttle");
    }
    int received = httpd_req_recv(request, body, request->content_len);
    if (received != (int)request->content_len) {
        return ESP_FAIL;
    }
    body[received] = '\0';
    if (httpd_query_key_value(body, "index", index_text,
                              sizeof(index_text)) != ESP_OK ||
        httpd_query_key_value(body, "throttle", throttle_text,
                              sizeof(throttle_text)) != ESP_OK ||
        s_esc_throttle_handler == NULL) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid ESC throttle");
    }
    unsigned long index = strtoul(index_text, NULL, 10);
    unsigned long throttle = strtoul(throttle_text, NULL, 10);
    if (index >= ESP32_WIFI_DRONE_REMOTE_ESC_COUNT || throttle > 1000U) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Unsupported ESC throttle");
    }
    esp_err_t err = s_esc_throttle_handler(
        (uint8_t)index, (float)throttle / 1000.0f, s_esc_context);
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   esp_err_to_name(err));
    }
    httpd_resp_set_status(request, "204 No Content");
    return httpd_resp_send(request, NULL, 0);
}

/**
 * @brief Convert a hexadecimal URL-encoding digit to its numeric value.
 *
 * @param character ASCII hexadecimal character.
 * @return Value from 0 through 15, or -1 when the character is invalid.
 */
static int url_hex_value(char character)
{
    if (character >= '0' && character <= '9') {
        return character - '0';
    }
    if (character >= 'a' && character <= 'f') {
        return character - 'a' + 10;
    }
    if (character >= 'A' && character <= 'F') {
        return character - 'A' + 10;
    }
    return -1;
}

/**
 * @brief Decode an application/x-www-form-urlencoded value in place.
 *
 * @param value Null-terminated encoded value to decode.
 * @return ESP_OK on success or ESP_ERR_INVALID_ARG for malformed `%XX` data.
 */
static esp_err_t url_decode(char *value)
{
    char *source = value;
    char *destination = value;

    while (*source != '\0') {
        if (*source == '+') {
            *destination++ = ' ';
            ++source;
        } else if (*source == '%') {
            if (source[1] == '\0' || source[2] == '\0') {
                return ESP_ERR_INVALID_ARG;
            }
            int high = url_hex_value(source[1]);
            int low = url_hex_value(source[2]);
            if (high < 0 || low < 0) {
                return ESP_ERR_INVALID_ARG;
            }
            *destination++ = (char)((high << 4) | low);
            source += 3;
        } else {
            *destination++ = *source++;
        }
    }
    *destination = '\0';
    return ESP_OK;
}

/**
 * @brief Restart the ESP32 after allowing the HTTP response to reach the phone.
 *
 * @param context Unused task context.
 */
static void delayed_restart_task(void *context)
{
    (void)context;
    vTaskDelay(pdMS_TO_TICKS(1500));
    esp_restart();
}

/** @brief Escape one Wi-Fi SSID for inclusion in a JSON string. */
static bool json_escape_ssid(const uint8_t *ssid, char *escaped, size_t size)
{
    size_t output = 0U;
    for (size_t input = 0U; ssid[input] != '\0'; ++input) {
        uint8_t value = ssid[input];
        if (value == '"' || value == '\\') {
            if (output + 2U >= size) {
                return false;
            }
            escaped[output++] = '\\';
            escaped[output++] = (char)value;
        } else if (value < 0x20U) {
            if (output + 6U >= size) {
                return false;
            }
            int written = snprintf(escaped + output, size - output,
                                   "\\u%04x", value);
            if (written != 6) {
                return false;
            }
            output += 6U;
        } else {
            if (output + 1U >= size) {
                return false;
            }
            escaped[output++] = (char)value;
        }
    }
    escaped[output] = '\0';
    return true;
}

/**
 * @brief Scan for nearby station networks and return them as JSON.
 *
 * AP-only operation is temporarily changed to AP+station mode so the access
 * point remains available while the station interface performs the scan.
 */
static esp_err_t wifi_scan_handler(httpd_req_t *request)
{
    wifi_mode_t original_mode;
    esp_err_t err = esp_wifi_get_mode(&original_mode);
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   esp_err_to_name(err));
    }

    bool restore_ap_mode = original_mode == WIFI_MODE_AP;
    if (restore_ap_mode) {
        s_wifi_scan_in_progress = true;
        err = esp_wifi_set_mode(WIFI_MODE_APSTA);
    }

