leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
    const wifi_scan_config_t scan_config = {
        .show_hidden = false,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
    };
    if (err == ESP_OK) {
        err = esp_wifi_scan_start(&scan_config, true);
    }

    wifi_ap_record_t records[20];
    uint16_t record_count = sizeof(records) / sizeof(records[0]);
    if (err == ESP_OK) {
        err = esp_wifi_scan_get_ap_records(&record_count, records);
    }
    if (restore_ap_mode) {
        esp_err_t restore_err = esp_wifi_set_mode(WIFI_MODE_AP);
        s_wifi_scan_in_progress = false;
        if (err == ESP_OK) {
            err = restore_err;
        }
    }
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   esp_err_to_name(err));
    }

    httpd_resp_set_type(request, "application/json");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    ESP_RETURN_ON_ERROR(httpd_resp_send_chunk(request, "[", 1), TAG,
                        "Could not start Wi-Fi scan response");

    bool first = true;
    for (uint16_t index = 0U; index < record_count; ++index) {
        if (records[index].ssid[0] == '\0') {
            continue;
        }
        bool duplicate = false;
        for (uint16_t previous = 0U; previous < index; ++previous) {
            if (strcmp((const char *)records[index].ssid,
                       (const char *)records[previous].ssid) == 0) {
                duplicate = true;
                break;
            }
        }
        if (duplicate) {
            continue;
        }

        char escaped_ssid[193];
        char item[256];
        if (!json_escape_ssid(records[index].ssid, escaped_ssid,
                              sizeof(escaped_ssid))) {
            continue;
        }
        int length = snprintf(item, sizeof(item),
                              "%s{\"ssid\":\"%s\",\"rssi\":%d}",
                              first ? "" : ",", escaped_ssid,
                              records[index].rssi);
        if (length < 0 || (size_t)length >= sizeof(item)) {
            continue;
        }
        ESP_RETURN_ON_ERROR(
            httpd_resp_send_chunk(request, item, (size_t)length), TAG,
            "Could not send Wi-Fi scan result");
        first = false;
    }
    ESP_RETURN_ON_ERROR(httpd_resp_send_chunk(request, "]", 1), TAG,
                        "Could not finish Wi-Fi scan response");
    return httpd_resp_send_chunk(request, NULL, 0);
}

/**
 * @brief Persist station credentials in their dedicated NVS partition.
 */
static esp_err_t save_station_credentials(const char *ssid,
                                          const char *password)
{
    nvs_handle_t nvs = 0;
    esp_err_t err = nvs_open_from_partition(
        WIFI_CREDENTIALS_PARTITION, WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs);
    if (err == ESP_OK) {
        err = nvs_set_str(nvs, "sta_ssid", ssid);
    }
    if (err == ESP_OK) {
        err = nvs_set_str(nvs, "sta_password", password);
    }
    if (err == ESP_OK) {
        err = nvs_commit(nvs);
    }
    if (nvs != 0) {
        nvs_close(nvs);
    }
    return err;
}

/**
 * @brief Store submitted station credentials and schedule a restart.
 *
 * The browser sends URL-encoded `ssid` and `password` fields. Credentials are
 * persisted in NVS and take precedence over menuconfig station credentials on
 * the next boot.
 *
 * @param request HTTP POST request for `/api/wifi-config`.
 * @return ESP_OK after responding, otherwise an ESP-IDF or HTTP-server error.
 */
static esp_err_t wifi_config_handler(httpd_req_t *request)
{
    /* URL encoding can expand every input byte to a three-byte %XX token. */
    char body[320];
    char ssid[sizeof(s_saved_station_ssid) * 3U];
    char password[sizeof(s_saved_station_password) * 3U];

    if (request->content_len == 0U ||
        request->content_len >= sizeof(body)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid form size");
    }

    size_t received_total = 0U;
    while (received_total < request->content_len) {
        int received = httpd_req_recv(
            request, body + received_total,
            request->content_len - received_total);
        if (received <= 0) {
            return ESP_FAIL;
        }
        received_total += (size_t)received;
    }
    body[received_total] = '\0';

    if (httpd_query_key_value(body, "ssid", ssid, sizeof(ssid)) != ESP_OK ||
        httpd_query_key_value(body, "password", password,
                              sizeof(password)) != ESP_OK ||
        url_decode(ssid) != ESP_OK || url_decode(password) != ESP_OK ||
        ssid[0] == '\0' ||
        strlen(ssid) >= sizeof(s_saved_station_ssid) ||
        strlen(password) >= sizeof(s_saved_station_password)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid Wi-Fi credentials");
    }

    esp_err_t err = save_station_credentials(ssid, password);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Could not save station credentials: %s",
                 esp_err_to_name(err));
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   "Could not save Wi-Fi credentials");
    }

    httpd_resp_set_type(request, "application/json");
    err = httpd_resp_sendstr(request, "{\"saved\":true}");
    if (err == ESP_OK &&
        xTaskCreate(delayed_restart_task, "wifi-restart", 2048, NULL, 5,
                    NULL) != pdPASS) {
        ESP_LOGE(TAG, "Could not create restart task");
    }
    return err;
}

/**
 * @brief Return the effective access-point settings without exposing its key.
 */
static esp_err_t ap_config_get_handler(httpd_req_t *request)
{
    char escaped_ssid[67];
    size_t output = 0U;
    for (const char *input = s_effective_config.ap_ssid;
         *input != '\0' && output + 2U < sizeof(escaped_ssid); ++input) {
        if (*input == '"' || *input == '\\') {
            escaped_ssid[output++] = '\\';
        }
        escaped_ssid[output++] = *input;
    }
    escaped_ssid[output] = '\0';

    char response[180];
    int length = snprintf(
        response, sizeof(response),
        "{\"ssid\":\"%s\",\"password_set\":%s,"
        "\"max_connections\":%u,\"tx_power\":%d}",
        escaped_ssid,
        s_effective_config.ap_password[0] != '\0' ? "true" : "false",
        s_effective_config.ap_max_connections,
        s_effective_config.ap_tx_power_quarter_dbm);
    httpd_resp_set_type(request, "application/json");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_send(request, response, length);
}

/**
 * @brief Persist access-point settings submitted by the settings page.
 */
static esp_err_t ap_config_post_handler(httpd_req_t *request)
{
    char body[512];
    char ssid[sizeof(s_saved_ap_ssid) * 3U];
    char password[sizeof(s_saved_ap_password) * 3U] = "";
    char clients_text[4];
    char power_text[4];
    char open_text[2];

    if (request->content_len == 0U ||
        request->content_len >= sizeof(body)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid form size");
    }
    size_t received_total = 0U;
    while (received_total < request->content_len) {
        int received = httpd_req_recv(
            request, body + received_total,
            request->content_len - received_total);
        if (received <= 0) {
            return ESP_FAIL;
        }
        received_total += (size_t)received;
    }
    body[received_total] = '\0';

    bool open_network =
        httpd_query_key_value(body, "open", open_text, sizeof(open_text)) ==
        ESP_OK;
    bool password_supplied =
        httpd_query_key_value(body, "password", password,
                              sizeof(password)) == ESP_OK;
    if (httpd_query_key_value(body, "ssid", ssid, sizeof(ssid)) != ESP_OK ||
        httpd_query_key_value(body, "clients", clients_text,
                              sizeof(clients_text)) != ESP_OK ||
        httpd_query_key_value(body, "tx_power", power_text,
                              sizeof(power_text)) != ESP_OK ||
        url_decode(ssid) != ESP_OK ||
        (password_supplied && url_decode(password) != ESP_OK)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid access-point settings");
    }

    int clients = atoi(clients_text);
    int tx_power = atoi(power_text);
    size_t ssid_length = strlen(ssid);
    size_t password_length = strlen(password);
    if (ssid_length == 0U || ssid_length >= sizeof(s_saved_ap_ssid) ||
        clients < 1 || clients > 10 ||
        (tx_power != 20 && tx_power != 40 &&
         tx_power != 60 && tx_power != 78) ||
        (!open_network && password_supplied && password_length > 0U &&
         password_length < 8U) ||
        password_length >= sizeof(s_saved_ap_password)) {
        return httpd_resp_send_err(request, HTTPD_400_BAD_REQUEST,
                                   "Invalid access-point settings");
    }

