leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
    nvs_handle_t nvs = 0;
    esp_err_t err = nvs_open("drone_remote", NVS_READWRITE, &nvs);
    if (err == ESP_OK) {
        err = nvs_set_str(nvs, "ap_ssid", ssid);
    }
    if (err == ESP_OK && open_network) {
        err = nvs_set_str(nvs, "ap_password", "");
    } else if (err == ESP_OK && password_supplied && password_length > 0U) {
        err = nvs_set_str(nvs, "ap_password", password);
    } else if (err == ESP_OK) {
        err = nvs_set_str(nvs, "ap_password",
                          s_effective_config.ap_password);
    }
    if (err == ESP_OK) {
        err = nvs_set_u8(nvs, "ap_clients", (uint8_t)clients);
    }
    if (err == ESP_OK) {
        err = nvs_set_i8(nvs, "ap_tx_power", (int8_t)tx_power);
    }
    if (err == ESP_OK) {
        err = nvs_commit(nvs);
    }
    if (nvs != 0) {
        nvs_close(nvs);
    }
    if (err != ESP_OK) {
        return httpd_resp_send_err(request,
                                   HTTPD_500_INTERNAL_SERVER_ERROR,
                                   "Could not save access-point settings");
    }

    httpd_resp_set_type(request, "application/json");
    err = httpd_resp_sendstr(request, "{\"saved\":true}");
    if (err == ESP_OK &&
        xTaskCreate(delayed_restart_task, "ap-restart", 2048, NULL, 5,
                    NULL) != pdPASS) {
        ESP_LOGE(TAG, "Could not create restart task");
    }
    return err;
}

/**
 * @brief Override compile-time network settings with values stored in NVS.
 *
 * Missing or invalid saved values are ignored, leaving the supplied runtime
 * configuration unchanged.
 *
 * @param config Runtime configuration supplied by the application.
 * @param effective Destination configuration used for Wi-Fi startup.
 */
static void apply_saved_network_config(
    const esp32_wifi_drone_remote_config_t *config,
    esp32_wifi_drone_remote_config_t *effective)
{
    *effective = *config;

    bool station_loaded = false;
    nvs_handle_t nvs = 0;
    esp_err_t err = nvs_open_from_partition(
        WIFI_CREDENTIALS_PARTITION, WIFI_NVS_NAMESPACE, NVS_READONLY, &nvs);

    size_t ssid_size = sizeof(s_saved_station_ssid);
    size_t password_size = sizeof(s_saved_station_password);
    if (err == ESP_OK) {
        err = nvs_get_str(nvs, "sta_ssid", s_saved_station_ssid, &ssid_size);
    }
    if (err == ESP_OK) {
        err = nvs_get_str(nvs, "sta_password", s_saved_station_password,
                          &password_size);
        if (err == ESP_ERR_NVS_NOT_FOUND) {
            s_saved_station_password[0] = '\0';
            err = ESP_OK;
        }
    }
    if (err == ESP_OK && s_saved_station_ssid[0] != '\0') {
        effective->station_ssid = s_saved_station_ssid;
        effective->station_password = s_saved_station_password;
        station_loaded = true;
        ESP_LOGI(TAG, "Using station credentials saved from the setup page");
    } else if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "Ignoring invalid saved station credentials: %s",
                 esp_err_to_name(err));
    }
    if (nvs != 0) {
        nvs_close(nvs);
        nvs = 0;
    }

    if (!station_loaded &&
        nvs_open(WIFI_NVS_NAMESPACE, NVS_READONLY, &nvs) == ESP_OK) {
        ssid_size = sizeof(s_saved_station_ssid);
        password_size = sizeof(s_saved_station_password);
        err = nvs_get_str(nvs, "sta_ssid", s_saved_station_ssid, &ssid_size);
        if (err == ESP_OK) {
            err = nvs_get_str(nvs, "sta_password",
                              s_saved_station_password, &password_size);
            if (err == ESP_ERR_NVS_NOT_FOUND) {
                s_saved_station_password[0] = '\0';
                err = ESP_OK;
            }
        }
        nvs_close(nvs);
        nvs = 0;
        if (err == ESP_OK && s_saved_station_ssid[0] != '\0') {
            effective->station_ssid = s_saved_station_ssid;
            effective->station_password = s_saved_station_password;
            station_loaded = true;
            err = save_station_credentials(s_saved_station_ssid,
                                           s_saved_station_password);
            if (err == ESP_OK) {
                ESP_LOGI(TAG, "Migrated station credentials to dedicated NVS");
            } else {
                ESP_LOGW(TAG, "Could not migrate station credentials: %s",
                         esp_err_to_name(err));
            }
        }
    }

    err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READONLY, &nvs);
    if (err != ESP_OK) {
        return;
    }
    size_t ap_ssid_size = sizeof(s_saved_ap_ssid);
    size_t ap_password_size = sizeof(s_saved_ap_password);
    if (nvs_get_str(nvs, "ap_ssid", s_saved_ap_ssid,
                    &ap_ssid_size) == ESP_OK &&
        nvs_get_str(nvs, "ap_password", s_saved_ap_password,
                    &ap_password_size) == ESP_OK) {
        effective->ap_ssid = s_saved_ap_ssid;
        effective->ap_password = s_saved_ap_password;
    }
    uint8_t clients;
    int8_t tx_power;
    if (nvs_get_u8(nvs, "ap_clients", &clients) == ESP_OK) {
        effective->ap_max_connections = clients;
    }
    if (nvs_get_i8(nvs, "ap_tx_power", &tx_power) == ESP_OK) {
        effective->ap_tx_power_quarter_dbm = tx_power;
    }
    nvs_close(nvs);
}

/**
 * @brief Dispatch a controller request to the configured application callback.
 *
 * When no callback is configured, the request is logged and acknowledged by
 * the original placeholder behavior.
 *
 * @param request HTTP POST request for a controller endpoint.
 * @return ESP_OK after responding, or an HTTP-server receive/send error.
 */
static esp_err_t api_handler(httpd_req_t *request)
{
    uint8_t body[256];
    size_t received_total = 0U;

    if (request->content_len > sizeof(body)) {
        httpd_resp_set_status(request, "413 Content Too Large");
        return httpd_resp_sendstr(request, "Controller request is too large");
    }

    while (received_total < request->content_len) {
        int received = httpd_req_recv(
            request, (char *)body + received_total,
            request->content_len - received_total);
        if (received <= 0) {
            return ESP_FAIL;
        }
        received_total += (size_t)received;
    }

    if (s_api_handler != NULL) {
        esp_err_t err = s_api_handler(request->uri, body, received_total,
                                      s_api_context);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "API callback rejected %s: %s", request->uri,
                     esp_err_to_name(err));
            return httpd_resp_send_err(request,
                                       HTTPD_500_INTERNAL_SERVER_ERROR,
                                       esp_err_to_name(err));
        }
    } else {
        ESP_LOGI(TAG, "Placeholder request: %s", request->uri);
    }

    httpd_resp_set_status(request, "204 No Content");
    return httpd_resp_send(request, NULL, 0);
}

/**
 * @brief Start the HTTP server and register page and controller endpoints.
 *
 * @return ESP_OK on success, otherwise an ESP-IDF HTTP-server error.
 */
static esp_err_t start_webserver(void)
{
    static const char *api_paths[] = {
        "/api/settings", /* Compatibility with cached controller pages. */
        "/api/turn-lock", "/api/brightness", "/api/headlight",
        "/api/sound", "/api/left-stick", "/api/right-stick",
    };
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 32;

