leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
    esp_err_t err = httpd_start(&s_server, &config);
    if (err != ESP_OK) {
        return err;
    }

    const httpd_uri_t page = {
        .uri = "/", .method = HTTP_GET, .handler = page_handler
    };
    err = httpd_register_uri_handler(s_server, &page);

    const httpd_uri_t wifi_page = {
        .uri = "/wifi",
        .method = HTTP_GET,
        .handler = wifi_setup_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &wifi_page);
    }

    const httpd_uri_t settings_page = {
        .uri = "/settings",
        .method = HTTP_GET,
        .handler = settings_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &settings_page);
    }

    const httpd_uri_t ap_settings_page = {
        .uri = "/settings/wifi-ap",
        .method = HTTP_GET,
        .handler = ap_settings_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &ap_settings_page);
    }

    const httpd_uri_t imu_settings_page = {
        .uri = "/settings/imu",
        .method = HTTP_GET,
        .handler = imu_settings_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &imu_settings_page);
    }

    const httpd_uri_t esc_settings_page = {
        .uri = "/settings/esc",
        .method = HTTP_GET,
        .handler = esc_settings_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &esc_settings_page);
    }

    const httpd_uri_t esc_pwm_channel_settings_page = {
        .uri = "/settings/esc/pwm-channels",
        .method = HTTP_GET,
        .handler = esc_pwm_channel_settings_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(
            s_server, &esc_pwm_channel_settings_page);
    }

    const httpd_uri_t esc_manual_page = {
        .uri = "/settings/esc/pwm-channels/manual",
        .method = HTTP_GET,
        .handler = esc_manual_page_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &esc_manual_page);
    }

    const httpd_uri_t wifi_config = {
        .uri = "/api/wifi-config",
        .method = HTTP_POST,
        .handler = wifi_config_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &wifi_config);
    }

    const httpd_uri_t wifi_scan = {
        .uri = "/api/wifi-scan",
        .method = HTTP_GET,
        .handler = wifi_scan_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &wifi_scan);
    }

    const httpd_uri_t status = {
        .uri = "/api/status",
        .method = HTTP_GET,
        .handler = status_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &status);
    }

    const httpd_uri_t latency = {
        .uri = "/api/latency",
        .method = HTTP_POST,
        .handler = latency_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &latency);
    }

    const httpd_uri_t telemetry = {
        .uri = "/api/telemetry",
        .method = HTTP_GET,
        .handler = telemetry_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &telemetry);
    }

    const httpd_uri_t imu_config_get = {
        .uri = "/api/imu-config",
        .method = HTTP_GET,
        .handler = imu_config_get_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &imu_config_get);
    }

    const httpd_uri_t imu_config_post = {
        .uri = "/api/imu-config",
        .method = HTTP_POST,
        .handler = imu_config_post_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &imu_config_post);
    }

    const httpd_uri_t esc_config_get = {
        .uri = "/api/esc-config",
        .method = HTTP_GET,
        .handler = esc_config_get_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &esc_config_get);
    }

    const httpd_uri_t esc_config_post = {
        .uri = "/api/esc-config",
        .method = HTTP_POST,
        .handler = esc_config_post_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &esc_config_post);
    }

    const httpd_uri_t esc_throttle_post = {
        .uri = "/api/esc-throttle",
        .method = HTTP_POST,
        .handler = esc_throttle_post_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &esc_throttle_post);
    }

    const httpd_uri_t ap_config_get = {
        .uri = "/api/ap-config",
        .method = HTTP_GET,
        .handler = ap_config_get_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &ap_config_get);
    }

    const httpd_uri_t ap_config_post = {
        .uri = "/api/ap-config",
        .method = HTTP_POST,
        .handler = ap_config_post_handler,
    };
    if (err == ESP_OK) {
        err = httpd_register_uri_handler(s_server, &ap_config_post);
    }

    for (size_t i = 0; err == ESP_OK &&
         i < sizeof(api_paths) / sizeof(api_paths[0]); ++i) {
        const httpd_uri_t api = {
            .uri = api_paths[i], .method = HTTP_POST, .handler = api_handler
        };
        err = httpd_register_uri_handler(s_server, &api);
    }

    if (err != ESP_OK) {
        httpd_stop(s_server);
        s_server = NULL;
    }
    return err;
}

/**
 * @brief Initialize NVS, the network stack, the event loop, and Wi-Fi.
 *
 * @return ESP_OK on success, otherwise the first ESP-IDF initialization error.
 */
static esp_err_t initialize_platform(void)
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES ||
        err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    if (err != ESP_OK) {
        return err;
    }

    err = nvs_flash_init_partition(WIFI_CREDENTIALS_PARTITION);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Persistent Wi-Fi credential storage unavailable: %s",
                 esp_err_to_name(err));
        return err;
    }

    err = esp_netif_init();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        return err;
    }
    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        return err;
    }

