leander98/esp32-wifi-drone-remote/esp32-wifi-drone-remote.c
    wifi_init_config_t wifi_config = WIFI_INIT_CONFIG_DEFAULT();
    return esp_wifi_init(&wifi_config);
}

/**
 * @brief Connect to the configured existing Wi-Fi network.
 *
 * @param config Component configuration containing station credentials and
 *               the connection timeout.
 * @return ESP_OK after receiving an IP address, ESP_ERR_TIMEOUT when the
 *         connection fails or times out, or another ESP-IDF error.
 */
static esp_err_t start_station(const esp32_wifi_drone_remote_config_t *config)
{
    if (strlen(config->station_ssid) >= sizeof(((wifi_config_t *)0)->sta.ssid) ||
        strlen(config->station_password) >=
            sizeof(((wifi_config_t *)0)->sta.password)) {
        return ESP_ERR_INVALID_ARG;
    }

    s_netif = esp_netif_create_default_wifi_sta();
    if (s_netif == NULL) {
        return ESP_ERR_NO_MEM;
    }
    ESP_RETURN_ON_ERROR(esp_netif_set_hostname(s_netif, NETWORK_HOSTNAME), TAG,
                        "Could not set station hostname");

    wifi_config_t wifi_config = { 0 };
    snprintf((char *)wifi_config.sta.ssid, sizeof(wifi_config.sta.ssid), "%s",
             config->station_ssid);
    snprintf((char *)wifi_config.sta.password,
             sizeof(wifi_config.sta.password), "%s",
             config->station_password);
    wifi_config.sta.threshold.authmode = WIFI_AUTH_OPEN;

    ESP_RETURN_ON_ERROR(esp_wifi_set_mode(WIFI_MODE_STA), TAG,
                        "Could not select station mode");
    ESP_RETURN_ON_ERROR(esp_wifi_set_config(WIFI_IF_STA, &wifi_config), TAG,
                        "Could not configure station");
    ESP_RETURN_ON_ERROR(esp_wifi_start(), TAG, "Could not start station");
    s_wifi_mode = WIFI_MODE_STA;

    EventBits_t bits = xEventGroupWaitBits(
        s_wifi_events, WIFI_CONNECTED_BIT | WIFI_FAILED_BIT, pdTRUE, pdFALSE,
        pdMS_TO_TICKS(config->station_timeout_ms));
    if ((bits & WIFI_CONNECTED_BIT) != 0U) {
        ESP_LOGI(TAG, "Connected to Wi-Fi network \"%s\"",
                 config->station_ssid);
        return ESP_OK;
    }
    return ESP_ERR_TIMEOUT;
}

/**
 * @brief Start the ESP32-hosted Wi-Fi access point.
 *
 * @param config Component configuration containing access-point settings.
 * @return ESP_OK on success, ESP_ERR_INVALID_ARG for invalid credentials, or
 *         another ESP-IDF Wi-Fi error.
 */
static esp_err_t start_access_point(
    const esp32_wifi_drone_remote_config_t *config)
{
    size_t ssid_length = strlen(config->ap_ssid);
    size_t password_length = strlen(config->ap_password);
    if (ssid_length == 0U ||
        ssid_length >= sizeof(((wifi_config_t *)0)->ap.ssid) ||
        password_length >= sizeof(((wifi_config_t *)0)->ap.password) ||
        (password_length > 0U && password_length < 8U)) {
        return ESP_ERR_INVALID_ARG;
    }

    s_netif = esp_netif_create_default_wifi_ap();
    if (s_netif == NULL) {
        return ESP_ERR_NO_MEM;
    }
    ESP_RETURN_ON_ERROR(esp_netif_set_hostname(s_netif, NETWORK_HOSTNAME), TAG,
                        "Could not set access-point hostname");

    wifi_config_t wifi_config = { 0 };
    snprintf((char *)wifi_config.ap.ssid, sizeof(wifi_config.ap.ssid), "%s",
             config->ap_ssid);
    snprintf((char *)wifi_config.ap.password,
             sizeof(wifi_config.ap.password), "%s", config->ap_password);
    wifi_config.ap.ssid_len = ssid_length;
    wifi_config.ap.max_connection = config->ap_max_connections;
    wifi_config.ap.authmode =
        password_length == 0U ? WIFI_AUTH_OPEN : WIFI_AUTH_WPA2_PSK;

    ESP_RETURN_ON_ERROR(esp_wifi_set_mode(WIFI_MODE_AP), TAG,
                        "Could not select access-point mode");
    ESP_RETURN_ON_ERROR(esp_wifi_set_config(WIFI_IF_AP, &wifi_config), TAG,
                        "Could not configure access point");
    ESP_RETURN_ON_ERROR(esp_wifi_start(), TAG, "Could not start access point");
    ESP_RETURN_ON_ERROR(
        esp_wifi_set_max_tx_power(config->ap_tx_power_quarter_dbm), TAG,
        "Could not set access-point transmit power");
    s_wifi_mode = WIFI_MODE_AP;
    ESP_LOGI(TAG, "Access point \"%s\" ready", config->ap_ssid);
    return ESP_OK;
}

esp_err_t esp32_wifi_drone_remote_start(
    const esp32_wifi_drone_remote_config_t *config)
{
    if (s_started) {
        return ESP_ERR_INVALID_STATE;
    }
    if (config == NULL || config->ap_ssid == NULL ||
        config->ap_password == NULL || config->ap_max_connections == 0U ||
        config->ap_tx_power_quarter_dbm < 8 ||
        config->ap_tx_power_quarter_dbm > 78 ||
        config->station_ssid == NULL || config->station_password == NULL ||
        config->station_timeout_ms == 0U ||
        config->latency_timeout_ms == 0U) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t err = initialize_platform();
    if (err != ESP_OK) {
        return err;
    }

    esp32_wifi_drone_remote_config_t effective_config;
    apply_saved_network_config(config, &effective_config);
    s_effective_config = effective_config;
    s_api_handler = effective_config.api_handler;
    s_api_context = effective_config.api_context;
    s_latency_handler = effective_config.latency_handler;
    s_latency_context = effective_config.latency_context;
    s_latency_timeout_ms = effective_config.latency_timeout_ms;
    s_telemetry_handler = effective_config.telemetry_handler;
    s_telemetry_context = effective_config.telemetry_context;
    s_imu_get_handler = effective_config.imu_get_handler;
    s_imu_set_handler = effective_config.imu_set_handler;
    s_imu_context = effective_config.imu_context;
    s_esc_get_handler = effective_config.esc_get_handler;
    s_esc_set_handler = effective_config.esc_set_handler;
    s_esc_throttle_handler = effective_config.esc_throttle_handler;
    s_esc_context = effective_config.esc_context;

    s_wifi_events = xEventGroupCreate();
    if (s_wifi_events == NULL) {
        esp_wifi_deinit();
        return ESP_ERR_NO_MEM;
    }
    err = esp_event_handler_instance_register(
        WIFI_EVENT, ESP_EVENT_ANY_ID, wifi_event_handler, NULL,
        &s_wifi_handler);
    if (err != ESP_OK) {
        esp32_wifi_drone_remote_stop();
        return err;
    }
    err = esp_event_handler_instance_register(
        IP_EVENT, IP_EVENT_STA_GOT_IP, wifi_event_handler, NULL,
        &s_ip_handler);
    if (err != ESP_OK) {
        esp32_wifi_drone_remote_stop();
        return err;
    }

    if (effective_config.station_ssid[0] != '\0') {
        err = start_station(&effective_config);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Station connection failed; starting access point");
            esp_wifi_stop();
            esp_netif_destroy_default_wifi(s_netif);
            s_netif = NULL;
            err = start_access_point(&effective_config);
        }
    } else {
        err = start_access_point(&effective_config);
    }

    if (err == ESP_OK) {
        err = start_mdns();
    }
    if (err == ESP_OK) {
        err = start_webserver();
    }
    if (err != ESP_OK) {
        esp32_wifi_drone_remote_stop();
        return err;
    }

    s_started = true;
    return ESP_OK;
}

esp_err_t esp32_wifi_drone_remote_stop(void)
{
    if (s_server != NULL) {
        httpd_stop(s_server);
        s_server = NULL;
    }
    if (s_mdns_started) {
        mdns_free();
        s_mdns_started = false;
    }
    esp_wifi_stop();
    if (s_netif != NULL) {
        esp_netif_destroy_default_wifi(s_netif);
        s_netif = NULL;
    }
    if (s_wifi_handler != NULL) {
        esp_event_handler_instance_unregister(
            WIFI_EVENT, ESP_EVENT_ANY_ID, s_wifi_handler);
        s_wifi_handler = NULL;
    }
    if (s_ip_handler != NULL) {
        esp_event_handler_instance_unregister(
            IP_EVENT, IP_EVENT_STA_GOT_IP, s_ip_handler);
        s_ip_handler = NULL;
    }
    esp_wifi_deinit();
    if (s_wifi_events != NULL) {
        vEventGroupDelete(s_wifi_events);
        s_wifi_events = NULL;
    }
    s_started = false;
    s_api_handler = NULL;
    s_api_context = NULL;
    s_latency_handler = NULL;
    s_latency_context = NULL;
    s_latency_timeout_ms = 150U;
    s_telemetry_handler = NULL;
    s_telemetry_context = NULL;
    s_imu_get_handler = NULL;
    s_imu_set_handler = NULL;
    s_imu_context = NULL;
    s_esc_get_handler = NULL;
    s_esc_set_handler = NULL;
    s_esc_throttle_handler = NULL;
    s_esc_context = NULL;
    s_wifi_mode = WIFI_MODE_NULL;
    return ESP_OK;
}
